In [1]:
import numpy as np
import pandas as pd

# Text handling

#### leaning textvalues can be incredibly hard.Invalid text values involves 99% of the time , mistyping
#### which is completely unpredicateable these days where data entry task has been replaced by machines.Still lets explore the mot common cases:

### Splitting columns

#### The result of a survey is loaded and this is what you get:

In [2]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US_1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
    ]})

In [3]:
df

              Data
0      1987_M_US_1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

#### You know that the single columns represents the values 'year,sex,country and number of children'but it,s all been grouped in the same column and separated by an underscore.Padas has a
#### a convenient method named split that we can use in this situations:

In [5]:
df['Data'].str.split('_')

0        [1987, M, US, 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [6]:
df['Data'].str.split('_', expand=True)

       0  1      2  3
0   1987  M     US  1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [7]:
df = df['Data'].str.split('_', expand=True)

In [8]:
df.columns = ['Year', 'Sex', 'Country', 'No of children']

#### You can also check which columns contain a given value with the contains method:

In [9]:
df

    Year Sex Country No of children
0   1987   M      US              1
1  1990?   M      UK              1
2   1992   F      US              2
3  1970?   M      IT              1
4   1985   F    I  T              2

In [10]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

#### Cointain takes a regex/pattern as face value , so we would need to excape the ? as it has a special meaning for this patterns: regular latters dont need escaping:

In [11]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

#### Removing blank spaces like in ('US or 'I T') can be achieved with stripes ,(lstipes or rstripes also exist) or just replce:

In [12]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [13]:
df['Country'].str.replace('  ', ' ')

0      US
1      UK
2      US
3      IT
4     I T
Name: Country, dtype: object

#### As we said replace and contain takes regex pattern,which can make it easier to replace values in bulk

In [16]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

C:\Users\user\AppData\Local\Temp/ipykernel_8976/2331653364.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object

#### But be warned:

#### Some people when confronted with a problem, think"i know,i will use regular expressions". Now they have two problems:

#### As you can see, all these strings/text- related operations are applied over the str attributes of the Series.that,s because they have a special place in Series handling and you can read more about it